auth/app/controllers/accounts_controller.rb

  def update
    respond_to do |format|
      new_role = @account.role != account_params[:role] ? account_params[:role] : nil

      if @account.update(account_params)
---
UPDATE "accounts" SET "role" = $1, "full_name" = $2, "updated_at" = $3 WHERE "accounts"."id" = $4  [["role", "admin"], ["full_name", "Trololo"], ["updated_at", "2022-10-08 09:43:52.584026"], ["id", 1]]